In [17]:
import pandas as pd
from sqlalchemy import create_engine
#import mysql_conn

In [26]:
avocados = "avocado.csv"

avocado_df=pd.read_csv(avocados)

avocado_df.head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2,2,2015-12-13,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany
3,3,2015-12-06,1.08,78992.15,1132.00,71976.41,72.58,5811.16,5677.40,133.76,0.0,conventional,2015,Albany
4,4,2015-11-29,1.28,51039.60,941.48,43838.39,75.78,6183.95,5986.26,197.69,0.0,conventional,2015,Albany

In [27]:
census_data = "census_data.csv"

census_df=pd.read_csv(census_data, encoding='latin-1')
census_df.head()

,Id,Country,City,Population,Housing units,Population Density,Housing Unit Density,2017 Median HH Income,2017 Median Age
0,0100000US,United States,United States,308745538(r38234),131704730(r15031),87.4,37.3,57652,37.8
1,0100000US,United States,Alabama,4779736(r38235),2171853(r15032),94.4,42.9,46472,38.7
2,0100000US,United States,Abanda CDP,192,79,64.0,26.4,-,32.7
3,0100000US,United States,Abbeville city,2688,1255,172.9,80.7,40724,44.9
4,0100000US,United States,Adamsville city,4522,1990,180.0,79.2,49077,42.7

In [19]:
#dropping all columns that we do not need in the avocado csv
trim_avocado=avocado_df.drop(['Unnamed: 0','4046','4225','4770','Total Bags','Small Bags','Large Bags','XLarge Bags','year','type'],axis=1)
trim_avocado.head()

         Date  AveragePrice  Total Volume  region
0  2015-12-27          1.33      64236.62  Albany
1  2015-12-20          1.35      54876.98  Albany
2  2015-12-13          0.93     118220.22  Albany
3  2015-12-06          1.08      78992.15  Albany
4  2015-11-29          1.28      51039.60  Albany

In [20]:
#dropping all columns that we do not need in the census csv
trim_census=census_df.drop(['Country','Id','Population','Housing units','Population Density', 'Housing Unit Density'],axis=1)
trim_census.head()

              City 2017 Median HH Income 2017 Median Age
0    United States                 57652            37.8
1          Alabama                 46472            38.7
2       Abanda CDP                     -            32.7
3   Abbeville city                 40724            44.9
4  Adamsville city                 49077            42.7

In [24]:
trimmed_avocado=trim_avocado.rename(columns={'Date':'date',
                                       'AveragePrice':'average_price',
                                       'Total Volume':'total_volume',
                                       })
trimmed_avocado.head()

         date  average_price  total_volume  region
0  2015-12-27           1.33      64236.62  Albany
1  2015-12-20           1.35      54876.98  Albany
2  2015-12-13           0.93     118220.22  Albany
3  2015-12-06           1.08      78992.15  Albany
4  2015-11-29           1.28      51039.60  Albany

In [29]:
trimmed_census=trim_census.rename(columns={'City':'city',
                                       '2017 Median HH Income':'city_median_income',
                                       '2017 Median Age':'city_median_age',
                                       })
trimmed_census.head()

              city city_median_income city_median_age
0    United States              57652            37.8
1          Alabama              46472            38.7
2       Abanda CDP                  -            32.7
3   Abbeville city              40724            44.9
4  Adamsville city              49077            42.7

In [33]:
# set index
census_df=trimmed_census.set_index('city')
census_df.head()

                city_median_income city_median_age
city
United States                57652            37.8
Alabama                      46472            38.7
Abanda CDP                       -            32.7
Abbeville city               40724            44.9
Adamsville city              49077            42.7

In [32]:
avocado_df=trimmed_avocado.set_index('region')
avocado_df.head()

              date  average_price  total_volume
region
Albany  2015-12-27           1.33      64236.62
Albany  2015-12-20           1.35      54876.98
Albany  2015-12-13           0.93     118220.22
Albany  2015-12-06           1.08      78992.15
Albany  2015-11-29           1.28      51039.60